Revit 2024 API
PipeFittingAndAccessoryConnectorData.FlowDirection Property
 The flow direction of this connector, In or Out.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public FlowDirectionType FlowDirection { get; }
Visual Basic
Public ReadOnly Property FlowDirection As FlowDirectionType
	Get
Visual C++
public:
property FlowDirectionType FlowDirection {
	FlowDirectionType get ();
}
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace